package lesson15.task3;

/* Задача №3*:
   Задана строка, которая может иметь внутри себя скобки. Скобкой считается
   любой из следующих символов — «(«, «)», «[«, «]», «/«, «)». Проверить
   сбалансированность расстановки скобок в этой строке. Набор скобок считается
   сбалансированной парой, если открывающая скобка "(" "[" и
   стоит слева от соответствующей закрывающей скобки ")", "]" и "}", соответственно.
   Строка, содержащая пары скобок, не сбалансирована, если набор заключенных в нее
   скобок не совпадает.

   Например, если ввод «{[(])}», пара квадратных скобок «[]» заключает в себя
   одну несбалансированную открывающую круглую скобку «(». Аналогично, пара
   круглых скобок «() ", заключает в себя одну несбалансированную
   закрывающую квадратную скобку "]". Таким образом, входная строка "{[(])]}"
   несбалансированная. */

public class Main {
  public static void main(String[] args) {
    StringBalance.startCheckingBalanceProgram();
  }
}
